---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.InvalidOperationException
source: html/a2c4c49d-0d5f-97ef-3216-31d455fe3025.htm
---
# InvalidOperationException Members

Retrieves data needed to serialize the target object.